# CLI tools
brew "bat"
brew "htop"
brew "nvim"
brew "ollama", restart_service: true
brew "pdftk-java"
brew "pwgen"
brew "ripgrep"
brew "uv"
brew "wget"

# For doom-emacs
brew "pngpaste"

# GUI apps
cask "alt-tab"
cask "discord"
cask "karabiner-elements"
cask "libreoffice"
cask "google-chrome"
cask "meld"
cask "monitorcontrol"
cask "portfolioperformance"
cask "raycast"
cask "rectangle-pro"
cask "ukelele"
cask "xmind"

# Fonts
cask "font-source-sans-3"

# Emacs
tap "d12frosted/emacs-plus"
brew "emacs-plus@29", args: ["with-native-comp"]

# Next: symlink it as `emacs` in your PATH
#       this is a post-install step, not in Brewfile
# brew link emacs-plus@29 --force
